<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"fe83729ff31c936207765840d77f05fdfc40d9095bd51ceae9d4aae5b88275e3","plan_job_ref":"Job Test plan target and replace #350 at https://github.com/dflook/terraform-github-actions/actions/runs/5553175125","plan_hash":"752b196977bf5373692b92e31370ec6acaa6d1722ee14b4ef32414c94d0813d3","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "lnDytE7zHq" -> (known after apply)
  ~ foreach = "cUkpiFKSje" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #350](https://github.com/dflook/terraform-github-actions/actions/runs/5553175125)